meat-plant/ssl/Documents/ПроизводствоСырья.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПроизводствоСырья</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиСырья</xr:Item>
				<xr:Item>AccumulationRegister.РабочееВремя</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЖивотных</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Животные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСырья</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСырья</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сырье</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сырье</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

meat-plant/ssl/Documents/ПроизводствоСырья/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПроизводствоСырья.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроизводствоСырья.Дата,
	|	ПроизводствоСырья.Количество,
	|	ПроизводствоСырья.Название,
	|	ПроизводствоСырья.Номер,
	|	ПроизводствоСырья.Склад,
	|	ПроизводствоСырья.Состав.(
	|		НомерСтроки,
	|		ТипСырья,
	|		Сырье,
	|		Количество
	|	),
	|	ПроизводствоСырья.Сотрудники.(
	|		НомерСтроки,
	|		Сотрудник
	|	)
	|ИЗ
	|	Документ.ПроизводствоСырья КАК ПроизводствоСырья
	|ГДЕ
	|	ПроизводствоСырья.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСоставШапка = Макет.ПолучитьОбласть("СоставШапка");
	ОбластьСостав = Макет.ПолучитьОбласть("Состав");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
        СуммаИтог = 0;
		ТабДок.Вывести(ОбластьСоставШапка);
		ВыборкаСостав = Выборка.Состав.Выбрать();
		Пока ВыборкаСостав.Следующий() Цикл
			ОбластьСостав.Параметры.Заполнить(ВыборкаСостав);
			ТабДок.Вывести(ОбластьСостав, ВыборкаСостав.Уровень());  
			СуммаИтог = СуммаИтог + ВыборкаСостав.Количество;
		КонецЦикла;

		ТабДок.Вывести(ОбластьСотрудникиШапка);
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());
		КонецЦикла;   
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Подвал.Параметры.Ответственный = ТекПользователь;
        Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " кг";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
